{
  "name": "Chun-Ju (Iridium)",
  "headerTaglineOne": "Hi there (ﾉ´∀｀*)",
  "headerTaglineTwo": "I'm Chun-Ju Tao,",
  "headerTaglineThree": "Computer Engineering MS student at NYU",
  "headerTaglineFour": "Passionate about creating innovative and scalable solutions with Software",
  "showCursor": false,
  "showBlog": false,
  "darkMode": true,
  "showResume": true,
  "socials": [
    {
      "title": "Github",
      "link": "https://github.com/iridiumtao"
    },
    {
      "title": "LinkedIn",
      "link": "https://linkedin.com/in/chun-ju-tao-3b1485254/"
    },
    {
      "title": "Email",
      "link": "mailto:c.tao@nyu.edu"
    },
    {
      "title": "Resume",
      "link": "/resume"
    }
  ],
  "projects": [
    {
      "id": "8",
      "title": "Oblivilight - OpenHCI'25",
      "subtitle": "HCI, LangChain",
      "startDate": "July 2025",
      "endDate": "August 2025",
      "description": "A privacy-focused AI-powered smart lamp that transforms nightly voice conversations into tangible memories.",
      "imageSrc": "https://raw.githubusercontent.com/iridiumtao/OpenHCI25-Oblivilight/refs/heads/main/docs/Cover.png?raw=true",
      "url": "https://github.com/iridiumtao/OpenHCI25-Oblivilight"
    },
    {
      "id": "7",
      "title": "Taigi (Taiwanese-Hokkien) Medical Advising LLM",
      "subtitle": "AI, ML, LLM",
      "startDate": "March 2025",
      "endDate": "May 2025",
      "description": "Fine-tuned Taigi (Taiwanese-Hokkien) medical advising LLM with a full-stack MLOps pipeline.",
      "imageSrc": "https://raw.githubusercontent.com/iridiumtao/Fine-Tuning-Taiwanese-Hokkien-LLM-for-Medical-Advising/refs/heads/main/docs/project_diagram.png",
      "url": "https://github.com/iridiumtao/Fine-Tuning-Taiwanese-Hokkien-LLM-for-Medical-Advising"
    },
    {
      "id": "1",
      "title": "Loud Plants in Your Area",
      "subtitle": "HCI, AR, ML",
      "startDate": "February 2024",
      "endDate": "May 2024",
      "description": "An Augmented Reality (AR) application that helps combat 'plant blindness' by making plant activities visible and interactive through augmented overlays.",
      "imageSrc": "https://raw.githubusercontent.com/iridiumtao/LoudPlantsInYourArea/refs/heads/main/docs/LoudPlantsInYourArea.jpeg",
      "url": "https://github.com/iridiumtao/LoudPlantsInYourArea"
    },
    {
      "id": "2",
      "title": "AI Editor-in-Chief and Virtual News Presenter",
      "subtitle": "An Artificial Intelligence-Based Pipeline for Automated News Production",
      "startDate": "September 2021",
      "endDate": "July 2023",
      "description": "A project aimed to catch teenagers’ attention and refocus on critical societal issues with AI-driven Natural Language Processing technologies in Taiwanese Mandarin.",
      "imageSrc": "https://raw.githubusercontent.com/iridiumtao/iridiumtao.github.io/refs/heads/master/docs/image/AI%20Editor-in-Chief%20and%20Virtual%20News%20Presenter.png",
      "url": "https://github.com/iridiumtao/Virtual-to-News-Public"
    },
    {
      "id": "3",
      "title": "RISC-V-Simulator",
      "startDate": "October 2024",
      "endDate": "December 2024",
      "description": "A 5-stage pipelined RISC-V Simulator written in Python.",
      "imageSrc": "https://raw.githubusercontent.com/iridiumtao/RISC-V-Simulator/refs/heads/master/docs/Schematic%20RISCV%20Project%20Five%20Stage.png",
      "url": "https://github.com/iridiumtao/RISC-V-Simulator"
    },
    {
      "id": "4",
      "title": "Retailpia",
      "subtitle": "Winner of Better Retail, Level-Up Society Hackathon, organized by ShowCode",
      "startDate": "July 2021",
      "endDate": "July 2021",
      "description": "Developed a city-building game that also included the additional feature of being an account book app and a points collector with students from four universities within 48 hours.",
      "imageSrc": "https://github.com/iridiumtao/Retailpia/assets/43561001/8d1d5603-e090-4694-9eea-562258a6c361",
      "url": "https://github.com/iridiumtao/Retailpia"
    },
    {
      "id": "5",
      "title": "TW-COVID-Bot (Telegram Bot)",
      "startDate": "August 2020",
      "endDate": "November 2022",
      "description": "During the COVID-19 pandemic in Taiwan, I assisted social media influencers in automatically posting daily outbreak information for easy access to up-to-date information.",
      "imageSrc": "https://github.com/lhsueh1/TW-covid-Bot/blob/main/src/README/img1.png?raw=true",
      "url": "https://github.com/lhsueh1/TW-covid-Bot"
    },
    {
      "id": "6",
      "title": "iOS Development",
      "startDate": "June 2020",
      "endDate": "October 2020",
      "description": "During the summer vacation of my second year of University, I participated in the summer iOS development practical training, cultivating skills in mobile development through hands-on experience with UI components and design patterns in the Intelligent Mobile Application Club (I.M.A.C) laboratory on campus.",
      "imageSrc": "https://raw.githubusercontent.com/iridiumtao/iridiumtao.github.io/refs/heads/master/docs/image/iOS%20Development.png",
      "url": "https://github.com/jerry960331/iOS_practice_SwiftUIWeatherApp"
    }
  ],
  "experiences": [
    {
      "id": "678d33ac-a854-4dce-9c0e-db5fae6cd91e",
      "title": "Data Science Intern, Micron",
      "description": "Built a production-scale pipeline and Streamlit app for fab-dispatch analysis (33GB/2 weeks), created an explainable LightGBM-SHAP model for parameter simplification, and developed repo-documentation tools cutting token use 10× and boosting developer efficiency 3×."
    },
    {
      "id": "1",
      "title": "Software Developer, CARITY AI",
      "description": "Developed a DevOps workflow with Docker and AWS ECS, optimizing deployment and reducing costs by 40%. Researched Agentic RAG, improving token efficiency fivefold for complex question-answering capabilities."
    },
    {
      "id": "2",
      "title": "Software Engineering Intern, MoBagel",
      "description": "Built a full-stack material management system automating budgeting and inventory for Taiwan Water Corporation. Led GitFlow and Agile adoption, boosting efficiency during a 300% team expansion."
    },
    {
      "id": "3",
      "title": "Software Engineering Intern, Mindtronic AI",
      "description": "Developed a back-end server with Golang and PostgreSQL, handling 480k+ weekly entries. Added React-based dashboard features and built real-time ARM-device apps for fleet driving analytics."
    }
  ],
  "aboutpara": "Chun-Ju Tao is a Computer Engineering master’s student at New York University (GPA: 3.83) specializing in MLOps, applied machine learning, and scalable cloud systems. With a strong foundation in both software development and data science, he is proficient in Python, Go, and JavaScript, and deeply skilled in the modern MLOps and cloud-native toolchain, including Docker, Terraform, AWS, PyTorch, and MLflow.\n\nNotable accomplishments include architecting a complete MLOps stack to fine-tune and deploy a custom LLM, featuring an automated, doctor-in-the-loop retraining pipeline with Airflow and MLflow. At Micron, he designed a production-scale Python pipeline and Streamlit web app to analyze terabytes of manufacturing data, enabling fast, reproducible studies across teams. At CARITY AI, he containerized microservices and automated CI/CD on AWS ECS, cutting infrastructure costs by 40% and deployment time by 70%.\n\nChun-Ju has demonstrated leadership by introducing Agile and GitFlow methodologies at MoBagel, stabilizing team management and improving efficiency during a 300% team expansion. An award-winning developer recognized at international conferences for technical innovation, his achievements reflect a commitment to driving operational excellence and delivering reliable, scalable, and data-driven solutions.",
  "resume": {
    "tagline": "Chun-Ju Tao",
    "description": "Passive about creating innovative and scalable solutions in Software. Experienced in designing backend systems, automating CI/CD pipelines, and building cloud-native MLOps platforms. Seeking a backend or software infrastructure role to tackle complex engineering challenges.",
    "experiences": [
      {
        "id": "dab034bf-1fa5-41ea-b336-64f66fbd76f9",
        "dates": "July 2025 - August 2025",
        "type": "Internship",
        "position": "Data Science Intern at Micron Technology",
        "location": "Taoyuan, Taiwan",
        "bullets": [
          "Architected a production-scale Python pipeline and Streamlit web app for fab-dispatch analysis, processing 2 weeks' logs (33GB) and delivering a self-serve interface for parameter tuning and rich visuals, enabling fast, reproducible studies and broad cross-team adoption.",
          "Developed an explainable LightGBM simulation proxy with SHAP analysis for lot-level decision tracing, enabling evidence-based simplification of scheduling parameters by quantifying which factors truly drive selection and reducing tuning overhead for production engineers.",
          "Engineered repo-documentation tools for an enterprise application with over one million lines of code using Prompt Engineering with Roo Code Orchestrator, MCP, and Qdrant; produced modular docs and standardized class/method summaries; cut token usage 10x and projected ~3x developer efficiency."
        ]
      },
      {
        "id": "1",
        "dates": "May 2024 - August 2024",
        "type": "Internship",
        "position": "Software Developer at CARITY AI",
        "location": "Ontario, Canada",
        "bullets": [
          "Automated CI/CD for an LLM-based product, containerizing 4 microservices on AWS ECS with GitHub Actions, reduced infrastructure costs by 40% and cut deployment time by 70%.",
          "Delivered a Proof-of-Concept using Retrieval-Augmented Generation (RAG), demonstrating a potential 5x reduction in token usage and influencing the team's future technical roadmap for cost optimization."
        ]
      },
      {
        "id": "2",
        "dates": "January 2023 - July 2023",
        "type": "Internship",
        "position": "Software Engineering Intern at MoBagel",
        "location": "Taichung, Taiwan",
        "bullets": [
          "Engineered a critical full-stack system to automate inventory and budgeting for trillions in government assets for the Taiwan Water Corporation, migrating a legacy Java 4 application to a modern .NET stack (C#, MS SQL, Vue.js) to enhance performance, security, and scalability.",
          "Proactively identified and reported critical security vulnerabilities across legacy and new systems, including SQL injection risks and an exposed database, preventing potential large-scale data breaches.",
          "Established GitFlow and an Agile development model for a 10-person team, fostering a culture of collaboration that improved development efficiency and stabilized team management during a 300% expansion."
        ]
      },
      {
        "id": "3",
        "dates": "June 2022 - September 2022",
        "type": "Internship",
        "position": "Software Engineering Intern at Mindtronic AI",
        "location": "Taipei, Taiwan",
        "bullets": [
          "Spearheaded the backend migration from Node.js to Go, re-architecting and building the new system from the ground up to enhance processing efficiency and system security; Mastered the Go language independently to deliver a robust, production-ready backend.",
          "Owned the full lifecycle of 53 RESTful APIs in Go, from design and implementation to documentation, proactively identified and eliminated critical SQL injection vulnerabilities across the entire API suite while ensuring the system could reliably process over 480,000 data entries weekly.",
          "Developed key data-rich features for the React frontend to enable real-time fleet monitoring, delivering complex user-facing functionalities including interactive dashboards, live video streaming, and vehicle trajectory visualization on a map."
        ]
      }
    ],
    "education": [
      {
        "id": "1",
        "universityName": "New York University",
        "universityDate": "May 2026",
        "location": "New York, NY",
        "degree": "Computer Engineering, M.S.",
        "gpa": "3.83",
        "relevantCoursework": [
          "Internet Architecture & Protocol",
          "Human Computer Interaction",
          "Machine Learning",
          "MLOps",
          "Reinforcement Learning"
        ]
      },
      {
        "id": "2",
        "universityName": "National Taichung University of Science and Technology (NTCUST)",
        "universityDate": "June 2023",
        "location": "Taichung, Taiwan",
        "degree": "Computer Science and Information Engineering, B.Eng.",
        "gpa": "3.79",
        "relevantCoursework": [
          "Software Engineering",
          "Electronic Commerce Security",
          "Algorithms",
          "Data Structures"
        ]
      }
    ],
    "skills": {
      "languages": [
        "Python",
        "JavaScript (React, Vue)",
        "Go",
        "Java",
        "C#",
        "Swift",
        "MS SQL",
        "PostgreSQL",
        "C"
      ],
      "cloudAndDevOps": [
        "Docker",
        "AWS ECS",
        "Terraform",
        "GitHub Actions",
        "Airflow",
        "Prometheus",
        "Grafana",
        "MinIO",
        "Git",
        "Linux"
      ],
      "dataAndML": [
        "PyTorch",
        "MLflow",
        "LlamaIndex",
        "Lang Chain",
        "LightGBM",
        "SHAP",
        "Streamlit",
        "FastAPI"
      ]
    },
    "projects": [
      {
        "id": "b2787423-bef6-463a-9e8c-7c973939e4eb",
        "title": "Privacy‑First AI Smart Lamp for Ephemeral Night Conversations - Oblivilight",
        "organization": "OpenHCI'25",
        "location": "Taipei, Taiwan",
        "dates": "July 2025 - August 2025",
        "details": [
          "Led a user-centric design process from research to prototype, identifying key user needs for tangible, privacy-preserving \"forgetting mechanisms\" in AI companions through 11 user interviews and secondary research.",
          "Architected a full-stack proof-of-concept integrating an LLM for conversation, emotion analysis, and a multi-modal interface with voice (Whisper/TTS) and gesture controls.",
          "Designed a novel interaction model that visualizes emotional sentiment as colored light and externalizes digital conversations into physical artifacts via a thermal printer, directly addressing AI data permanence anxiety.",
          "Won the Best Demo Award at OpenHCI'25 and was the sole project selected for presentation at the subsequent TAICHI'25 conference."
        ]
      },
      {
        "id": "4391db8e-1b56-435e-a510-f929e328a871",
        "title": "Real‑Time Plant Health & Mood Visualization - Loud Plants in Your Area",
        "organization": "NYU",
        "location": "New York, NY",
        "dates": "February 2025 - May 2025",
        "details": [
          "Initiated and led the end-to-end development of a novel iOS application that translates plant bio-acoustic signals into real-time, AR visualizations, defining the project vision and architecting the full technology stack.",
          "Engineered a custom machine learning pipeline based on academic research to classify plant health. Independently implemented a deep scattering network (ScatNet with Morlet wavelets), extracted Mel-frequency cepstral coefficients (MFCCs), and trained a high-performing SVM classifier for signal analysis.",
          "Developed a fully functional AR prototype using Swift, RealityKit, and Reality Composer Pro. Owned the entire iOS application development, building custom animated UI overlays that rendered dynamic plant statuses based on live data from the ML pipeline.",
          "Validated the project's core hypothesis through a user evaluation study that demonstrated the AR interface significantly increased user-plant interaction and emotional connection (mean score increase from 1.67 to 5.33, p=0.018)."
        ]
      },
      {
        "id": "843a0605-bfc9-47e7-bccb-52d310723cfe",
        "title": "Taigi (Taiwanese-Hokkien) Medical Advising LLM",
        "organization": "NYU",
        "location": "New York, NY",
        "dates": "March 2025 - May 2025",
        "details": [
          "Architected a cloud-native MLOps platform for LLM using Terraform for IaC, and deployed a suite of Docker-based microservices (FastAPI, Gradio, MinIO) to production.",
          "Orchestrated a Continuous Training (CT) pipeline with Airflow for human-in-the-loop retraining, and established system observability using Prometheus and Grafana.",
          "Fine-tuned an 8B LLaMA-3.1 into the first Taigi medical advisor using 120K bilingual Q&A pairs with LoRA + mixed-precision on an A100 GPU; tracked all runs in MLflow for full reproducibility."
        ]
      },
      {
        "id": "1",
        "title": "RISC-V-Simulator",
        "organization": "NYU",
        "location": "New York, NY",
        "dates": "October 2024 - December 2024",
        "details": [
          "Architected a RISC-V processor simulator in Python, implementing both single-stage and five-stage pipelined designs to analyze and compare architectural performance trade-offs.",
          "Engineered a comprehensive hazard management system for the five-stage pipeline, featuring dedicated data forwarding units, a load-use hazard detection unit for stall insertion, and a branch forwarding unit with early resolution in the ID stage to minimize control hazards.",
          "Developed a parallel simulation workflow to execute identical RISC-V programs on both pipelines simultaneously, ensuring accurate, side-by-side comparison of outputs and performance metrics.",
          "Built an automated performance analysis module that calculates and reports key metrics, including total cycle count, instructions per cycle (IPC), and cycles per instruction (CPI) for each processor core."
        ]
      },
      {
        "id": "2",
        "title": "AI Editor-in-Chief and Virtual News Presenter",
        "organization": "Natural Language Process Lab, NTCUST",
        "location": "Taichung, Taiwan",
        "dates": "September 2021 - July 2023",
        "details": [
          "Led a year-long capstone project from concept to award-winning completion, architecting a fully automated AI pipeline that autonomously generated animated news segments from trending topics.",
          "Engineered the core system infrastructure to resolve critical dependency and versioning conflicts across 5 disparate open-source microservices; designed and implemented a resilient data pipeline using Docker Compose and Flask to ensure system integrity and enable scalable future development.",
          "Automated the end-to-end deployment process for the entire stack, creating a reproducible, one-command build that slashed manual setup and deployment time by over 80% (from 2 hours to 20 minutes).",
          "Pioneered the team's adoption of GitFlow, establishing a structured version control workflow that significantly improved development velocity and collaboration, and served as a foundational experience for implementing Agile methodologies in subsequent professional roles."
        ]
      },
      {
        "id": "3",
        "title": "TW-COVID-Bot (Telegram Bot)",
        "organization": "Spontaneous Study",
        "location": "Taipei, Taiwan",
        "dates": "August 2020 - November 2022",
        "details": [
          "During the COVID-19 pandemic in Taiwan, I assisted social media influencers in automatically posting daily outbreak information for easy access to up-to-date information.",
          "Volunteered to organize developers to set up a server and developed a bot that utilized web crawling, image generating, and data analysis.",
          "Automatically graphing daily COVID-19 cases from 200 countries to track the level of spread."
        ]
      },
      {
        "id": "4",
        "title": "iOS Developer",
        "organization": "I.M.A.C. Lab, NTCUST",
        "location": "Taichung, Taiwan",
        "dates": "June 2020 - October 2020",
        "details": [
          "Designed a weather app with MVVM, implementing weather API, Realm Database, and MapKit.",
          "Designed a bank app with MVC, implementing biometric authenticating, notification broadcasting, and real-time currency displaying.",
          "Utilized Swift UI layout systems such as Storyboards and SwiftUI with Swift5."
        ]
      },
      {
        "id": "5",
        "title": "Retailpia",
        "organization": "Level-Up Society Hackathon",
        "location": "UK",
        "dates": "September 2021",
        "details": [
          "Led a team of 4 students from 4 universities to develop a city-building game with an account book app and points collector within 48 hours.",
          "Winner of Better Retail, Level-Up Society Hackathon, organized by ShowCode."
        ]
      }
    ],
    "honors": [
      {
        "id": "7c11e028-878a-4373-b445-9b6d792d3ef2",
        "title": "1st prize & Best Demo",
        "event": "OpenHCI’25, presented at the 11th Annual TAICHI Conference",
        "location": "Taipei, Taiwan",
        "year": "2025"
      },
      {
        "id": "1",
        "title": "Emerging Technology Application Award",
        "event": "Fi-Award 2023 by the 13th International Conference on Frontier Computing",
        "location": "Tokyo, Japan",
        "year": "2023"
      },
      {
        "id": "2",
        "title": "1st prize in Project Competition",
        "organization": "College of Information and Distribution Science, NTCUST",
        "location": "Taichung, Taiwan",
        "year": "2023"
      },
      {
        "id": "3",
        "title": "Winner of Better Retail",
        "event": "Level-Up Society Hackathon",
        "organizer": "ShowCode",
        "location": "UK",
        "year": "2021"
      }
    ]
  }
}